package model;

import java.util.List;

public class Options {
    public static final List<List<String>> options = List.of(
            List.of("Вы - молодой пират, член команды легендарного капитана Черной Бороды. Сегодня вечером, во время сбора команды в кают-компании, вы узнали, что сокровища, о которых слагают легенды, находятся на одном из близлежащих островов. Вы находитесь в своей каюте, готовясь отправиться на поиски сокровищ. Ваши действия?", "Пойти сообщить капитану","Сбежать и отправиться в поиски самому"),
            List.of("Вы и ваш экипаж прибываете на остров, который, как говорят легенды, скрывает несметные сокровища. После длительных поисков, вы находите старый заброшенный маяк, где, кажется, спрятаны сокровища. Ваши действия?", "Начать потасовку, в которой вы втихую уносите кучу золота","Предложить поделить сокровища поровну между всеми"),
            List.of("Вы решаете не сообщать капитану и сбежать с сокровищем. Вы находите способ украсть карту и отправляетесь на остров один. Однако по пути вас атакуют дикие животные, и вы погибаете в схватке."),
            List.of("Вам везет, и вы действительно ускользаете с золотом, однако, путь вам преградил еще один такой хитрец, который, к сожалению, выглядит крепче вас. Ваши действия?", "Отдать долю и уйти с миром", "Вступить в драку и получить еще больше золота"),
            List.of("Пиратам такое предложение по душе, но они осознали, что если убить вас, то каждый получит больше золота. Вы не успели ступить и шага, как в вас уже выстрелили в голову"),
            List.of("Ты отплываешь от острова с сокровищами, пока остальные пираты застряли на нем без еды и воды. Победа"),
            List.of("На этот раз удача была неблагосклонна к вам, и вас убили, а затем ограбили")
        );
}
